000_РОЗНИЦА_ЦЕНТР/src/Catalogs/НастройкиБотов/НастройкиБотов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиБотов</name>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/НастройкиБотов/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТестПодключения(Команда)
	ТестированиеПодключения();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ТестированиеПодключения()
	
	НастройкиПодключения = Новый Структура;
	НастройкиПодключения.Вставить("АдресСервера", 	Объект.АдресСервера);
	НастройкиПодключения.Вставить("Порт", 			Объект.Порт);
	НастройкиПодключения.Вставить("Таймаут", 		Объект.Таймаут);
	НастройкиПодключения.Вставить("Токен", 			Объект.Токен);
		
	ТекстСообщения = "";
	
	ВыполнитьТестовоеПодключениеКСайту(НастройкиПодключения, ТекстСообщения);
	
	ПоказатьПредупреждение(, ТекстСообщения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьТестовоеПодключениеКСайту(НастройкиПодключения, ТекстСообщения)
	
	ОтветОк = ОповещенияПользователей.ОправитьЗапросНаСерверТелеграм("getMe", НастройкиПодключения, Новый Структура,, ТекстСообщения);

	Возврат ОтветОк;
	
КонецФункции

#КонецОбласти
